# Top Selling Insurance

In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import pickle

In [2]:
# Import Feature Engineered data file
df = pd.read_csv('insurance_review_cleaned.csv')
df

,Date,Motor_Insurance,Years_of_experience,Vehicle_Type,Vehicle_Make,Vehicle_Model,Insurance_experience,Rate,Vehicle
0,2021/06/05,SRI LANKA INSURANCE,Between 1 -5 Years,LORRY,ASHOK-LEYLAND,CARGO 1618,GOOD FULL INSURANCE FOR HEAVY VEHICLES,4,ASHOK-LEYLAND CARGO 1618
1,2021/06/05,COOPERATIVE INSURANCE COMPANY LTD.,Between 5 - 10 Years,THREE WHEEL,BAJAJ,4 STROKE,CURRENTLY IM SATISFIED WITH THE SERVICE,3,BAJAJ 4 STROKE
2,2021/06/05,FAIRFIRST INSURANCE LIMITED,Less than 1 Year,CAR,TOYOTA,COROLLA 121,PROVIDE GOOD SERVICE FOR THE CUSTOMER,4,TOYOTA COROLLA 121
3,2021/06/05,CEYLINCO GENERAL INSURANCE LIMITED,Between 5 - 10 Years,CAR,TOYOTA,VITZ,EXCELLENT SERVICE,5,TOYOTA VITZ
4,2021/06/05,AIA INSURANCE LANKA LTD.,Less than 1 Year,CAR,TOYOTA,YARIS,GOOD,4,TOYOTA YARIS
...,...,...,...,...,...,...,...,...,...
295,2021/09/27,SRI LANKA INSURANCE,Between 5 - 10 Years,CAR,TOYOTA,COROLLA 110,TO APPLY THE CLAIM IS VERY EASY IN A SINGLE CA...,5,TOYOTA COROLLA 110
296,2021/09/27,SRI LANKA INSURANCE,Between 5 - 10 Years,CAR,NISSAN,SUNNY B15,TO APPLY THE CLAIM IS VERY EASY IN A SINGLE CA...,4,NISSAN SUNNY B15
297,2021/09/27,SRI LANKA INSURANCE,Between 5 - 10 Years,CAR,TOYOTA,COROLLA 110,TO APPLY THE CLAIM IS VERY EASY IN A SINGLE CA...,5,TOYOTA COROLLA 110
298,2021/09/27,SRI LANKA INSURANCE,Between 5 - 10 Years,CAR,NISSAN,SUNNY B15,TO APPLY THE CLAIM IS VERY EASY IN A SINGLE CA...,5,NISSAN SUNNY B15
299,2021/09/27,SRI LANKA INSURANCE,Between 5 - 10 Years,CAR,NISSAN,SUNNY B15,TO APPLY THE CLAIM IS VERY EASY IN A SINGLE CA...,5,NISSAN SUNNY B15

In [5]:
# Find the no of vehicle for each Insurance
top_insurance = df.groupby(['Motor_Insurance']).agg({'Vehicle':'count'})
top_insurance

                                    Vehicle
Motor_Insurance
AIA INSURANCE LANKA LTD.                 10
ALLIANZ INSURANCE LANKA LTD.             25
AMANA TAKAFUL PLC                        15
ASSETLINE INSURANCE                       2
CEYLINCO GENERAL INSURANCE LIMITED       53
CONTINENTAL INSURANCE                     2
COOPERATIVE INSURANCE                     1
COOPERATIVE INSURANCE COMPANY LTD.       12
FAIRFIRST INSURANCE LIMITED              14
HNB ASSURANCE PLC                        17
JANASHAKTHI INSURANCE PLC                19
LOLC                                      1
ORIENT INSURANCE                          8
ORIENTAL INSURANCE                        1
PEOPLE'S INSURANCE                        1
SRI LANKA INSURANCE                     119

In [6]:
# Reset the index by converting the Motor_Insurance into a column
top_insurance.reset_index(inplace=True)
top_insurance

                       Motor_Insurance  Vehicle
0             AIA INSURANCE LANKA LTD.       10
1         ALLIANZ INSURANCE LANKA LTD.       25
2                    AMANA TAKAFUL PLC       15
3                  ASSETLINE INSURANCE        2
4   CEYLINCO GENERAL INSURANCE LIMITED       53
5                CONTINENTAL INSURANCE        2
6                COOPERATIVE INSURANCE        1
7   COOPERATIVE INSURANCE COMPANY LTD.       12
8          FAIRFIRST INSURANCE LIMITED       14
9                    HNB ASSURANCE PLC       17
10           JANASHAKTHI INSURANCE PLC       19
11                                LOLC        1
12                    ORIENT INSURANCE        8
13                  ORIENTAL INSURANCE        1
14                 PEOPLE'S INSURANCE         1
15                 SRI LANKA INSURANCE      119

In [8]:
#Rename the Column
top_insurance.rename(columns={"Vehicle": "Vehicle_Count"}, inplace=True)
top_insurance

                       Motor_Insurance  Vehicle_Count
0             AIA INSURANCE LANKA LTD.             10
1         ALLIANZ INSURANCE LANKA LTD.             25
2                    AMANA TAKAFUL PLC             15
3                  ASSETLINE INSURANCE              2
4   CEYLINCO GENERAL INSURANCE LIMITED             53
5                CONTINENTAL INSURANCE              2
6                COOPERATIVE INSURANCE              1
7   COOPERATIVE INSURANCE COMPANY LTD.             12
8          FAIRFIRST INSURANCE LIMITED             14
9                    HNB ASSURANCE PLC             17
10           JANASHAKTHI INSURANCE PLC             19
11                                LOLC              1
12                    ORIENT INSURANCE              8
13                  ORIENTAL INSURANCE              1
14                 PEOPLE'S INSURANCE               1
15                 SRI LANKA INSURANCE            119

In [10]:
# Rank the Motor_Insurance by most number of sold
top_insurance['Top_Sell_Insurance'] = top_insurance['Vehicle_Count'].rank(method='min',ascending=False).astype(int)
top_insurance

                       Motor_Insurance  Vehicle_Count  Top_Sell_Insurance
0             AIA INSURANCE LANKA LTD.             10                   9
1         ALLIANZ INSURANCE LANKA LTD.             25                   3
2                    AMANA TAKAFUL PLC             15                   6
3                  ASSETLINE INSURANCE              2                  11
4   CEYLINCO GENERAL INSURANCE LIMITED             53                   2
5                CONTINENTAL INSURANCE              2                  11
6                COOPERATIVE INSURANCE              1                  13
7   COOPERATIVE INSURANCE COMPANY LTD.             12                   8
8          FAIRFIRST INSURANCE LIMITED             14                   7
9                    HNB ASSURANCE PLC             17                   5
10           JANASHAKTHI INSURANCE PLC             19                   4
11                                LOLC              1                  13
12                    ORIENT INSURANCE              8                  10
13                  ORIENTAL INSURANCE              1                  13
14                 PEOPLE'S INSURANCE               1                  13
15                 SRI LANKA INSURANCE            119                   1

In [17]:
# top selling insurance
top_insurance10 = top_insurance.sort_values("Top_Sell_Insurance").head(10)
top_insurance10

                       Motor_Insurance  Vehicle_Count  Top_Sell_Insurance
15                 SRI LANKA INSURANCE            119                   1
4   CEYLINCO GENERAL INSURANCE LIMITED             53                   2
1         ALLIANZ INSURANCE LANKA LTD.             25                   3
10           JANASHAKTHI INSURANCE PLC             19                   4
9                    HNB ASSURANCE PLC             17                   5
2                    AMANA TAKAFUL PLC             15                   6
8          FAIRFIRST INSURANCE LIMITED             14                   7
7   COOPERATIVE INSURANCE COMPANY LTD.             12                   8
0             AIA INSURANCE LANKA LTD.             10                   9
12                    ORIENT INSURANCE              8                  10

In [18]:
#Write the Rankings into a .csv file
top_insurance10.to_csv('CSV/top_insurance.csv',index=False)
# Create a Pickle (.pkl) file with the Ranking dataframe
pickle.dump(top_insurance10, open('Models/top_insurance.pkl','wb'))

In [11]:
import pickle
import os
from os import getcwd

directory = getcwd()

top_insurance_model = pickle.load(open(os.path.join(directory, 'Models/top_insurance.pkl'), 'rb'))
tim = top_insurance_model.sort_values('Top_Sell_Insurance', ascending=True)[['Motor_Insurance', 'Vehicle_Count']]\
        .head(10).reset_index(
        drop=True)

tim

                      Motor_Insurance  Vehicle_Count
0                 SRI LANKA INSURANCE            119
1  CEYLINCO GENERAL INSURANCE LIMITED             53
2        ALLIANZ INSURANCE LANKA LTD.             25
3           JANASHAKTHI INSURANCE PLC             19
4                   HNB ASSURANCE PLC             17
5                   AMANA TAKAFUL PLC             15
6         FAIRFIRST INSURANCE LIMITED             14
7  COOPERATIVE INSURANCE COMPANY LTD.             12
8            AIA INSURANCE LANKA LTD.             10
9                    ORIENT INSURANCE              8